# -*- coding=utf-8 -*-


def grade(student_response, grader_payload):
    """
    Пример оценивающей функции. По общему дизайну и философии, единственное, о
    чём она может знать, это что ответил пользователь (без уточнения данных,
    позволяющих его каким-либо образом идентифицировать), а также полезную
    информацию для грэйдера (например, внутренний идентификатор задания в
    рамках оценивающей платформы).

    :param student_response: Ответ пользователя
    :param grader_payload: Нагрузка для оценивания
    :return: tuple (оценка, сообщение)
    """
    pass
